InformationRegisters/СтавкиРефинансирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>СтавкиРефинансирования</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтавкаРефинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкаРефинансирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтавкиРефинансирования/Ext/ManagerModule.bsl
Функция СтавкаРефинансирования(Период) Экспорт 
	
	ЗначениеВозврата = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиРефинансированияСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.СтавкиРефинансирования.СрезПоследних(КонецПериода(&Период, ДЕНЬ), ) КАК СтавкиРефинансированияСрезПоследних
		|//ГДЕ
		|//	СтавкиРефинансированияСрезПоследних.СтавкаРефинансирования = &СтавкаРефинансирования";
	//   
	СтавкаРефинансирования = Справочники.СтавкаРефинансирования.ПустаяСсылка();
	Запрос.УстановитьПараметр("СтавкаРефинансирования", СтавкаРефинансирования); 
	Запрос.УстановитьПараметр("Период", Период);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗначениеВозврата = ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;
	
	Возврат ЗначениеВозврата;
	
КонецФункции
